Repository: seanpm2001/mt-training-data
Catalog: tn/tn_pontoon.tmx
Source language: en_us
Languages: tn

source: The multi-language version of the Common Voice dataset is currently undergoing community supported bundling and cleaning. If you would like to help us bring Common Voice to new languages, go check out the <sentenceCollectorLink>Sentence Collection Tool</sentenceCollectorLink> for adding new sentences to the dataset, and Mozilla <pontoonLink>Pontoon</pontoonLink> for translating the website itself. New languages are added to Common Voice for voice contribution when 5000 approved sentences have been collected.
tn: Ga jaana karolo ya dipuo tse dintsi ya tshedimosetso ya Common Voice e kgobokanngwa le go phepafadiwa ke morafe. Fa o batla go re thusa go tlisa Common Voice mo dipuong tse disha, leba <sentenceCollectorLink>Thulusu ya go Kgobokanya Dipolelo</sentenceCollectorLink> go tsenya dipolelo tse disha mo tshedimosetsong, le Mozilla <pontoonLink>Pontoon</pontoonLink> go ranola webosaete ka boyone. Dipuo tse disha di tsenngwa mo Common Voice go aba mantswe fa dipolelo tse di dumeletsweng di le 5000 di kgobokantswe.

source: The number of recordings and which languages you contribute to will be public.
tn: Palo ya dikgatiso le dipuo tse o nnang le seabe mo go tsone di tla bonwa ke batho botlhe.

source: The process by which a contributor’s profile information is obscured from their donated voice clips when packaged for download as a part of the dataset.
tn: Thulaganyo e ka yone tshedimosetso ya porofaele ya moabi e fitlhegileng mo dikgatisong tsa mantswe fa e baakanyeditswe go itseelwa jaaka karolo ya tshedimosetso.

source: There are a lot of public organizations that might want to collaborate and already have a lot of texts they can donate as public domain. Reach out to local universities, Governments and open source organizations to talk about the project and ask for their help.
tn: Go na le mekgatlho e mentsi ya puso e e ka batlang go nna le seabe mme e setse e na le mekwalo e mentsi e e ka e abang. Ikgolaganye le diyunibesithi tsa selegae, Dipuso le mekgatlho e mengwe go bua ka porojeke mme o ba kope thuso.

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
tn: Go na le ditsela tse dintsi tsa go akanya ka puo. Ka ntlha ya dikao tsa go lemoga puo, Common Voice e akantsha go tlhoma mogopolo mo ‘botlhaleng jo bo utlwalang’, kgotsa ‘a babui ba puo eno gantsi ba a tlhalognyana fa ba leka go dira jalo?’

source: The recording was too long.
tn: Kgatiso e ne e le telele thata.

source: The recording was too quiet.
tn: Kgatiso e ne e didimetse thata.

source: The recording was too short.
tn: Kgatiso e ne e le khutshwane thata.

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
tn: Go tla nna le dipharologano tsa tlholego mo bolumong ya babadi. Gana fela fa bolumo e le kwa godimo thata mo kgatiso e kgaogang, kgotsa (se se tlwaelegileng thata) fa e le kwa tlase thata mo o sa utlweng se se buiwang kwantle ga go leba se se kwadilweng.

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
tn: Ga jaana dipuo tseno di tokafadiwa ke badirisi. <localizationGlossaryLink>Go ranola webosaete</localizationGlossaryLink> le <sentenceCollectionGlossaryLink>go kgobokanya mela</sentenceCollectionGlossaryLink> go a tlhokega go diragatsa.

source: The selected file is too large
tn: Faele e e tlhophilweng e kgolo thata

source: The Sentence Collector is part of <commonVoiceLink>Common Voice</commonVoiceLink>. It allows contributors to collect and validate sentences created by the community. You can use this tool also to import and clean-up small-to-medium-sized public domain corpus you have found or collected. All sentences need to be Public Domain. Approved sentences are exported every week to the Common Voice repository and are released on the Common Voice website on every new deployment.
tn: Sekgobokanyi sa Dipolelo ke karolo ya <commonVoiceLink>Common Voice</commonVoiceLink>. Se letla baabi go tsaya le go tlhomamisa dipolelo tse di dirilweng ke baagi. Gape o ka dirisa sedirisiwa seno go tsenya le go phepafatsa dikarolo tse dinnye go ya go tse di mo magareng tsa lefelo la botlhe tse o di fitlhetseng kgotsa tse o di kgobokantseng. Dipolelo tsotlhe di tshwanetse go nna tsa Lefelo la Botlhe. Dipolelo tse di dumeletsweng di romelwa beke le beke kwa bobolokelong jwa Common Voice mme nako le nako fa go nna le tlhabololo nngwe le nngwe e ntšha di gololelwe mo webosaeteng ya Common Voice.

source: The sentence has a grammatical or spelling error.
tn: Mola o na le phoso ya thutapuo kgotsa ya mopeleto.

source: The sentence has disrespectful or offensive language.
tn: Mola o na le puo ya lenyatso kgotsa e e kgopisang.

source: The sentence must be grammatically correct.
tn: Mola o tshwanetse wa bo o kwadilwe sentle.

source: The sentence must be speakable.
tn: Mola o tshwanetse go buega.

source: The sentence must be spelled correctly.
tn: Mola o tshwanetse wa bo o peletilwe sentle.

source: The site is ready to be launched when it reaches 75% completion.
tn: Saete e siametse go tlhaga fa e setse e tsamaya mo 75% gore e fediwe.

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
tn: Webosaete e tla bo e boetse mo maemong ka bonako jo bo kgonegang. Go bona tshedimosetso ya bosheng, tsweetswee nna karolo ya <matrixLink>puisano ya setlhopha sa Matrix</matrixLink> kgotsa etela <githubLink>GitHub</githubLink> kgotsa <discourseLink>diforamo tsa rona tsa Discourse</discourseLink> go romela le go tlhokomela mathata a webosaete.

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
tn: Tshedimosetso ya TED-LIUM e dirilwe go dirisiwa dipuo tsa mantswe le ditlankana tsa bone tse di kopolotsweng tse di mo websaeteng ya TED.

source: The website text is translated into that language.
tn: Mokwalo ya webosaete o ranolwetswe mo puong eo.

source: This is approximately the number of hours required to train a production speech-to-text system.
tn: Tseno ke diura tse di fopholediwang gore di ka dirisiwa go ruta metšhine ya mafoko-go-puo gore e dire.

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
tn: Eno ke karolwana e e berekang e e nang le tshedimosetso ya go matlafatsa mokgwa wa go dirisa puo le o o kgonang go lemoga ee / nnyaa.

source: This is our process for translating and adapting our content for many locales (languages).
tn: Ono ke mokgwa wa rona wa go ranola le go dira gore tshedimosetso ya rona e tsamaisane le dipuo di le dintsi.

source: This page gives you an overview of all your submitted sentences. You may also delete already submitted sentences if needed, by marking the checkbox next to it and clicking on &quot;Delete selected sentences&quot; at the bottom. Please only remove sentences if absolutely necessary, for example if you noticed after the fact that a sentence is copyright protected.
tn: Tsebe eno e go naya dintlhakakaretso tsa dipolelo tsotlhe tse o di rometseng. Gape o ka phimola mela e e rometsweng fa go tlhokega, ka go tshwaya lebokoso gaufi le one le go tobetsa &quot;Phimola polelo e e tlhophilweng&quot; kwa tlase. Tsweetswee tlosa dipolelo fela fa tota go tlhokega, ka sekai, fa o lemoga morago ga ntlha nngwe gore polelo eo e na le tshireletso ya tetlokhopi.

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
tn: Seting eno e laola tsela e o bonang lenaane la baetapele ka yone. Fa e fitlhegile, kgatelopele ya gago e tla nna ya poraefete. Seno se raya gore setshwantsho sa gago, leinatiriso la gago le kgatelopele ya gago ga di kitla di bonala mo lenaaneng la baetapele. Ela tlhoko gore go tlhabolola lenaane la baetapele go tsaya metsotso e le ~{ $minutes } go bontsha diphetogo.

source: Three to go!
tn: Go setse di le tharo!

source: Tigre
tn: Se-Tigre

source: Tigrinya
tn: Se-Tigrinya

source: Today
tn: Gompieno

source: Today's Common Voice progress on clips recorded
tn: Kgatelopele ya gompieno ya Common Voice ya dikgatiso tse di dirilweng

source: Today's Common Voice progress on clips validated
tn: Kgatelopele ya gompieno ya Common Voice ya dikgatiso tse di tlhomamisitsweng

source: Today's Progress
tn: Kgatelopele ya Gompieno

source: Toki Pona
tn: Se-Toki Pona

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
tn: Gore kgatiso ya lentswe e tsene mo rekotong ya tshedimosetso ya Common Voice, e tshwanetse ya bo e tlhomamisitswe ke badirisi ba babedi.

source: To make the Common Voice dataset as useful as possible we have decided to only allow source text that is available under a Creative Commons (CC0) license. Using the CC0 standard means its more difficult to find and collect source text, but allows anyone to use the resulting voice data without usage restrictions or authorization from Mozilla. Ultimately, we want to make the multi-language dataset as useful as possible to everyone, including researchers, universities, startups, governments, social purpose organizations, and hobbyists.
tn: Go dira gore tshedimosetso ya Common Voice e nne mosola kafa go ka kgonegang ka gone, re dirile tshwetso ya go letlelela fela mokwalo o o leng teng mo laesenseng ya Creative Commons (CC0). Go dirisa molawana wa CC0 go raya gore go thata go bona le go kgobokanya mokwalo wa konokono, mme go letla gore mongwe le mongwe a dirise tshedimosetso e e felelang ka gone ya mantswe kwantle ga dithibelo tsa tiriso kgotsa tetlelelo ya Mozilla. Kwa bofelong, re batla gore tshedimosetso ya dipuo tse dintsi e nne mosola go mongwe le mongwe kafa go ka kgonegang ka gone, go akaretsa babatlisisi, diyunibesithi, dithulaganyo tsa tshimologo, dipuso, mekgatlho ya boikaelelo jwa loago, le batho ba ba dirang dilo go itlosa bodutu.

source: Top Contributors
tn: Baabi ba ba Kwa Godimo

source: Total
tn: Palogotlhe

source: Total Approved
tn: Palogotlhe ya tse di Amogetsweng

source: { $totalHours } hours is achievable in just over { $periodMonths } months if { $people } people record { $clipsPerDay } clips a day.
tn: { $totalHours } diura di ka fitlhelelwa mo { $periodMonths } dikgwedi fa { $people } batho rekoto { $clipsPerDay } dikgatiso ka letsatsi.

source: { $totalInReview } sentences in review.
tn: Mela e le { $totalInReview } e e sekasekiwang.

source: { $totalSentences } total sentences.
tn: Palogotlhe ya mela e le { $totalSentences }.

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
tn: Kafa mojeng re bontsha mesola mme re tlhalosa gore ke tshedimosetso efe e re e phasalatsang. Dirisa dilinki tse di fa tlase go simolola akhaonto ya Common Voice mo sedirisiweng sa gago.

source: Toward next goal
tn: Go ya maikaelelong a a latelang

source: Track progress here and on your stats page.
tn: Leba kgatelopele fano le mo tsebeng ya dipalopalo.

source: Translate this page
tn: Ranola tsebe eno

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
tn: <translateVideoLink>Leba kaedi ya rona e e buang ka tsela ya go dirisa Pontoon.</translateVideoLink>

source: Translating the site
tn: Go ranola saete

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
tn: Go ranolwa go tswa mo Seesemaneng, mme o ka bona <strong>Dikakantsho</strong> ka dipuo tse dingwe. Tobetsa letshwao la <strong>Porofaele</strong>, go tswa foo linki ya <strong>Diseting</strong> o bo o tsenya dipuo dipe tse o di buang. Kwa sekhutlhong se se kwa tlase kafa mojeng go tla nna le lenaane la dithanolo tse di bidiwang <strong>Locales</strong>. Dithanolo di bonala mo webosaeteng morago ga letsatsi le le lengwe.

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
tn: Thanolo ya webosaete ya Common Voice e direga mo <strong>Pontoon</strong>.

source: Tshivenda
tn: Sevenda

source: Turkish
tn: Se-Turkey

source: Turkmen
tn: Se-Turkmen

source: Twi
tn: Se-Twi

source: Typically megabytes
tn: Di-megabyte tse di sa reng sepe

source: Ubykh
tn: Se-Ubykh

source: Udmurt
tn: Se-Udmurt

source: Ukrainian
tn: Se-Ukrain

source: Understand contribution criteria
tn: Tlhaloganya mokgwa wa go abelana

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
tn: Tlhaloganya gore o tshwanetse go batla eng fa o reeditse dikgatiso tsa mantswe mme o thuse go dira gore dikgatiso tsa gago tsa mantswe di tshwanele!

source: Unexpected response returned from server
tn: Phetolo e e sa solofelwang go tswa kwa sefareng

source: Unfortunately we can’t have Wikimedia articles yet. So do not copy paste from there.
tn: Ka maswabi ga re ise re kgone go nna le diathikele tsa Wikimedia. Ka jalo o se ka wa kopolola o bo o tsenya go tswa koo.

source: { $unreviewedSentencesByYou } sentences left for you to review.
tn: Mela e e setseng e le { $unreviewedSentencesByYou } e o tlhokang go e sekaseka.

source: Updating…
tn: E a tlhabololwa

source: Upload aborted. Do you want to delete your recordings?
tn: Go tsenngwa go emisitswe. A o batla go phimola dikgatiso tsa gago?

source: Upload an image file
tn: Tsenya faele ya setshwantsho

source: Urdu
tn: Se-Urdu

source: User Name
tn: Leinatiriso

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
tn: Badirisi ba tlhomamisa gore a direkoting tse go abalanweng ka tsone di nepagetse, ba tlhola gore a sebui se bala mela sentle.

source: Using Common Voice
tn: Go Dirisa Common Voice

source: Uyghur
tn: Se-Uyghur

source: Uzbek
tn: Se-Uzbek

source: Validated Clips
tn: Dikgatiso Tse di Tlhomamisitsweng

source: Validated Hours
tn: Diura Tse di Tlhomamisitsweng

source: Validated Hr. Total
tn: Palogotlhe ya Diura Tse di Tlhomamisitsweng

source: { $validatedSentences } validated sentences.
tn: Mela e le { $validatedSentences } e e tlhomamisitsweng.

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
tn: Go tlhomamisa dikgatiso tse di abilweng le gone go botlhokwa mo maikaelelong a Common Voice. Reetsa mme o re thuse go dira tshedimosetso e e nang le boleng ya mantswe.

source: Validation Progress
tn: Kgatelopele ya go Tlhomamisa

source: Validations
tn: Ditlhomamiso

source: Value and recognition.
tn: Boleng le go lemogiwa.

source: Variants are a specific form of a language - for example shared by those living in a geography or commmunity. Sometimes these are called dialects.
tn: Dipuo ke mofuta o o rileng wa leleme - ka sekai, le buiwa ke batho ba ba nnang mo lefelong kgotsa mo morafeng o le mongwe. Ka dinako dingwe di bidiwa diteme.

source: Varying Pronunciations
tn: Go Bitsa Mafoko Go go Sa Tshwaneng

source: Venetian
tn: Se-Venice

source: Version
tn: Thanolelo

source: Vietnamese
tn: Se-Vietnam

source: View your progress against personal and project goals.
tn: Leba kgaletopele ya gago fa go lejwa maikaelelo a gago le a porojeke.

source: Visible
tn: E a bonala

source: Voice clips are entered into a submission queue that readies them for listening.
tn: Dikgatiso tsa mantswe di tsena mo moleng wa go romelwa o o dirang gore di siamele go reediwa.

source: Voice Contribution
tn: Go Neelana ka Lentswe

source: Voice Dataset, Ready for Download
tn: Rekoto ya Tshedimosetso ya Mantswe, e Siametse go Itseelwa.

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
tn: Lentswe ke la tlholego, lentswe ke la motho. Ke gone ka moo re itumelelang go direla metšhine ya rona thekenoloji e e berekang ya mantswe. Mme go dira dithulaganyo tsa mantswe, badiri ba tlhoka tshedimosetso e ntsi thata ya mantswe.

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
tn: Lentswe ke la tlholego, lentswe ke la motho. Ke gone ka moo re itumelelang go direla metšhine ya rona thekenoloji e e berekang ya mantswe. Mme go dira dithulaganyo tsa mantswe, badiri ba tlhoka tshedimosetso e ntsi thata ya mantswe.

source: Voice recognition technology is revolutionizing the way we interact with machines, but the currently available systems are expensive and proprietary. Common Voice is part of Mozilla’s initiative to make voice recognition technologies better and more accessible for everyone. Common Voice is a massive global database of donated voices that lets anyone quickly and easily train voice-enabled apps in potentially every language.
tn: Thekenoloji ya go lemoga mantswe e tlisa diphetogo mo tseleng e re dirisanang le metšhine ka yone, mme ditsamaiso tse di leng teng ga jaana di a tura e bile ke tsa poraefete. Mozilla Common Voice ke kgato e e tokafatsang thekenoloji ya go lemoga mantswe le go dira gore mongwe le mongwe a kgone go e fitlhelela. Common Voice ke tshedimosetso e kgolo tota ya lefatshe lotlhe ya mantswe a a abilweng e e letlang gore mongwe le mongwe a thapise dithulaganyo tsa mantswe ka bonako le ka tsela e e motlhofo ka puo nngwe le nngwe.

source: Voice recognition technology is revolutionizing the way we interact with machines, but the currently available systems are expensive and proprietary. Mozilla Common Voice is an initiative to make voice recognition technologies better and more accessible for everyone. Common Voice is a massive global database of donated voices that lets anyone quickly and easily train voice-enabled apps in potentially every language. We're not only collecting voice samples in widely spoken languages but also in those with a smaller population of speakers. Publishing a diverse dataset of voices will empower developers, entrepreneurs, and communities to address this gap themselves.
tn: Thekenoloji ya go lemoga mantswe e tlisa diphetogo mo tseleng e re dirisanang le metšhine ka yone, mme ditsamaiso tse di leng teng ga jaana di a tura e bile ke tsa poraefete. Mozilla Common Voice ke kgato e e tokafatsang thekenoloji ya go lemoga mantswe le go dira gore mongwe le mongwe a kgone go e fitlhelela. Common Voice ke tshedimosetso e kgolo tota ya lefatshe lotlhe ya mantswe a a abilweng e e letlang gore mongwe le mongwe a thapise dithulaganyo tsa mantswe ka bonako le ka tsela e e motlhofo ka puo nngwe le nngwe. Ga re tseye disampole tsa mantswe fela mo dipuong tse di buiwang thata mme re di tsaya gape le mo go tse di buiwang ke batho ba le mmalwa. Go phasalatsa tshedimosetso e e farologaneng ya mantswe go tla matlafatsa badiri, bagwebi, le baagi go samagana le bothata jono ka bobone.

source: Voices Online Now
tn: Mantswe a a mo Inthaneteng Jaanong

source: Voice Validation
tn: Go Tlhomamisa Lentswe

source: Volume
tn: Bolumo

source: Votic
tn: Se-Votic

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
tn: VoxForge e ne e diretswe go phutha puo e e kwalolotsweng gore e dirisiwe e dirisa Metswedi ya Mahala ya go Lemoga Puo e e Dirisiwang ke Batho Botlhe.

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
tn: A o batla go thusa go dira gore Common Voice e nne botoka go gaisa? Go gontle! Golagana le rona ka imeile kgotsa diforamo tsa <discourseLink>Discourse</discourseLink>, romela mathata a webosaete ka <githubLink>GitHub</githubLink>, kgotsa nna karolo ya puisano ya morafe ya <matrixLink>Matrix</matrixLink>.

source: Want to stay in touch with Common Voice?
tn: A o batla go nna o ikgolaganya le Common Voice?

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
tn: A o batla re go itsise fa re golola tokololo e ntšha ya rekoto ya tshedimosetso ya Common Voice? Ikwadisetse makwalodikgang a rona.

source: Watch our video explainer to help
tn: Leba bidio e e tlhalosang go go thusa

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
tn: Re aga rekoto ya tshedimosetso ya mantswe e mongwe le mongwe a ka e dirisang go thapisa dithulaganyo tse di kgonang go dirisa mantswe.

source: We are going out to get a coffee.
tn: Re a tswa re ya go batla kofi.

source: We are going out to get coffee.
tn: Re a tswa re ya go batla kofi.

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
tn: Rona mo Mozilla re dira morafe o o tla dirisang thekenoloji ya mantswe. Re rata go nna re itse ka ditlhabololo, metswedi ya tshedimosetso e ntšha le go utlwa mo go oketsegileng gore o dirisa tshedimosetso eno jang.

source: We believe that large and publicly available voice datasets foster innovation and healthy commercial competition in machine-learning based speech technology. This is a global effort and we invite everyone to participate. Our aim is to help speech technology be more inclusive, reflecting the diversity of voices from around the world.
tn: Re dumela gore tshedimosetso e kgolo le e e phasaladitsweng ya mantswe e rotloetsa go tlhama le kgaisano ya kgwebo mo thekenolojing e e ikaegileng ka go ithuta ga metšhine. Ano ke matsapa a lefatshe lotlhe mme re laletsa mongwe le mongwe go tsaya karolo. Boikaelelo jwa rona ke go thusa thekenoloji ya go bua gore e akaretse dilo tse dintsi, e bontshe pharologano ya mantswe go ralala lefatshe.
